rottenpotatoes/app/controllers/movies_controller.rb

  def similar_movies
    @movie = Movie.find(params[:movie])
    if @movie.director == "Unknown"
      flash[:notice] = "'#{@movie.title}' has no director info."
      redirect_to movies_path
    else
      @movies = Movie.find_similar(@movie)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 14]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]